"IOConnectionReceptaclePort" = "포트";
"IOConnectionReceptacleSlot" = "슬롯";
"IOConnectionReceptacleBay"  = "베이";
"IOConnectionReceptacleJack" = "Jack";

"IOConnectionPositionTop"      = "상단";
"IOConnectionPositionUpper"    = "위";
"IOConnectionPositionBottom"   = "하단";
"IOConnectionPositionLower"    = "아래";
"IOConnectionPositionLeft"     = "왼쪽";
"IOConnectionPositionRight"    = "오른쪽";
"IOConnectionPositionFront"    = "앞으로";
"IOConnectionPositionBack"     = "뒤로";
"IOConnectionPositionExternal" = "외장";
"IOConnectionPositionInternal" = "내장";
"IOConnectionPositionBuiltIn"  = "내장";

"IOConnectionMultipleParents" = "다중 장비로 추가됨";

/* Order used to build strings is always: Vendor, DeviceName, DeviceClass,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatDeviceName"                  = "%1$@";
"IODescriptionFormatDeviceClass"                 = "%1$@";
"IODescriptionFormatVendorDeviceName"            = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceClass"           = "%1$@ %2$@";
"IODescriptionFormatDeviceNameDeviceClass"       = "%1$@ %2$@";
"IODescriptionFormatVendorDeviceNameDeviceClass" = "%1$@ %2$@ %3$@";

/* Order used to build strings is always: Position, Kind, Receptacle, Index,
 * even when some are missing. Ordering numbers must be sequential from 1,
 * because the formatting function can't handle gaps.
 */
"IODescriptionFormatConnectionKind"                        = "%1$@";
"IODescriptionFormatConnectionKindIndex"                   = "%1$@ %2$@";
"IODescriptionFormatConnectionReceptacle"                  = "%1$@";
"IODescriptionFormatConnectionReceptacleIndex"             = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacle"              = "%1$@ %2$@";
"IODescriptionFormatConnectionKindReceptacleIndex"         = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKind"                = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionKindIndex"           = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionReceptacle"          = "%1$@ %2$@";
"IODescriptionFormatConnectionPositionReceptacleIndex"     = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacle"      = "%1$@ %2$@ %3$@";
"IODescriptionFormatConnectionPositionKindReceptacleIndex" = "%1$@ %2$@ %3$@ %4$@";

"IODescriptionFormatCombinedNameConnection"      = "%1$@, %2$@";
"IODescriptionFormatCombinedNameMultipleParents" = "%1$@(%2$@)";

"IODescriptionFormatCombinedMultipleParents" = "다중 장비로 추가된 장비";

"IODescriptionDelimiter" = " -> ";
